Revit 2027 API
ParameterTypeId.RebarSystemHookOrientTopDirn1 Property
 "Top Major Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientTopDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientTopDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientTopDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientTopDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace